m_1 = [9, 28, 13, 25, 7, 27, 15, 23, 24, 40]
m_2 = [39, 27, 36, 37, 19, 30, 23, 17, 25, 28]
m_3 = [37, 5, 9, 8, 6, 33, 34, 28, 14, 12]
m_4 = [8, 23, 12, 20, 32, 15, 21, 12, 8, 33]
result = []


'''
Задачи:
	1 переложить m_1, m_2, m_3, m_4 в result только уникальные через цикл for
	2 переложить m_1, m_2, m_3, m_4 в result только уникальные через цикл while
	3 переложить m_1, m_2, m_3, m_4 в result только четные уникальные
	4 переложить из m_1, m_2, m_3, m_4 в result через цикл for только нечетные уникальные
	5 переложить из m_1, m_2, m_3, m_4 только простые числа
	http://ru.math.wikia.com/wiki/%D0%9F%D1%80%D0%BE%D1%81%D1%82%D0%BE%D0%B5_%D1%87%D0%B8%D1%81%D0%BB%D0%BE
	6 составить в result максимально возможную квадратную матрицу из четных (цикл for)
	7 составить в result максимально возможную квадратную матрицу из четных (цикл for)
	https://ru.wikipedia.org/wiki/%D0%9A%D0%B2%D0%B0%D0%B4%D1%80%D0%B0%D1%82%D0%BD%D0%B0%D1%8F_%D0%BC%D0%B0%D1%82%D1%80%D0%B8%D1%86%D0%B0
'''

print('1', m_1)

print(m_2)
