'''
	!!!! К каждй задаче придумать свои тестовые кейсы.

	1) Есть строка. Каких букв больше? Заглавных или строчных?
	a) Заменить все пробелы на +
	б) Заменить несколько идущих подряд пробелов на один +


	2) Дана строка, состоящая из слов, разделенных пробелами. 
	Определите, сколько в ней слов. Используйте для решения задачи метод count.

	3) Дана строка. Разрежьте ее на две равные части 
	(если длина строки — четная, а если длина строки нечетная, 
	то длина первой части должна быть на один символ больше). 
	Переставьте эти две части местами, результат запишите 
	в новую строку и выведите на экран.


	4)Дана строка, состоящая ровно из двух слов, разделенных пробелом. 
	Переставьте эти слова местами. Результат запишите 
	в строку и выведите получившуюся строку.
	 
	5)Дана строка. Если в этой строке буква f встречается
	только один раз, выведите её индекс. Если она встречается два 
	и более раз, выведите индекс её первого и последнего появления. 
	Если буква f в данной строке не встречается, ничего не выводите.

	6)Дана строка. Найдите в этой строке второе вхождение буквы f,
	и выведите индекс этого вхождения. Если букваf в данной строке 
	встречается только один раз, выведите число -1, а если не встречается ни разу, 
	выведите число -2.

	7)Дана строка, в которой буква h встречается минимум два раза. 
	Удалите из этой строки первое и последнее вхождение буквы h, 
	а также все символы, находящиеся между ними.
'''