'''
	!!!! К каждй задаче придумать свои тестовые кейсы.

	1) Дана строка. Замените в этой строке все цифры 1 на слово one.

	2) Дана строка. Замение в этой строке все появления буквы h на букву H, 
	кроме первого и последнего вхождения.

	3) Дана строка. Удалите из нее все символы, чьи индексы делятся на 3.

	4) Дана строка, в которой буква h встречается минимум два раза. 
	Удалите из этой строки первое и последнее вхождение буквы h, 
	а также все символы, находящиеся между ними.
	 
	5) Дана строка, в которой буква h встречается как минимум два раза. 
	Разверните последовательность символов, заключенную между первым 
	и последнием появлением буквы h, в противоположном порядке.
'''